src/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Сотрудники/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(отказ, проверяемыеРеквизиты)
    сообщение = Новый СообщениеПользователю();
    сообщение.Текст = "Неверный формат ввода.";

    Если НЕ Справочники.Сотрудники.ВалидацияПолейФио(Фамилия, Истина) Тогда
        сообщение.Поле = "Фамилия";
        сообщение.УстановитьДанные(ЭтотОбъект);
        сообщение.Сообщить();
        проверяемыеРеквизиты.Удалить(проверяемыеРеквизиты.Найти(сообщение.Поле));
        отказ = Истина;
        Возврат;
    КонецЕсли;

    Если НЕ Справочники.Сотрудники.ВалидацияПолейФио(Имя) Тогда
        сообщение.Поле = "Имя";
        сообщение.УстановитьДанные(ЭтотОбъект);
        сообщение.Сообщить();
        проверяемыеРеквизиты.Удалить(проверяемыеРеквизиты.Найти(сообщение.Поле));
        отказ = Истина;
        Возврат;
    КонецЕсли;

    Если ЗначениеЗаполнено(Отчество) И НЕ Справочники.Сотрудники.ВалидацияПолейФио(Отчество) Тогда
        сообщение.Поле = "Отчество";
        сообщение.УстановитьДанные(ЭтотОбъект);
        сообщение.Сообщить();
        проверяемыеРеквизиты.Удалить(проверяемыеРеквизиты.Найти(сообщение.Поле));
        отказ = Истина;
        Возврат;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий
